/*
数组元素的倒置
*/
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	int a[4] = {1,2,3,4};
	int i,j;
	int t;
	i = 0;
	j = 3;
	while (i<j)//一定要揣摩一下为什么要写成i<j，而不能写成i<4;这点非常重要
	{
		t = a[i];
		a[i] = a[j];
		a[j] = t;
		++i;
		--j;
	}
	for(i = 0;i<4;++i)
		printf("a[%d] = %d\n",i,a[i]);
	return 0;
}
/*
------------------------
输出结果：
a[0] = 4
a[1] = 3
a[2] = 2
a[3] = 1
------------------------
总结：
数组的倒置中一定要注意如果改为i<4的话，整个数组的元素在对称互换后又会互换一次，因此i的互换只需要到中间即可（这样前半组就和后半组互换,如果有奇数个元素，则中间的元素不参与互换），否则就达不到互换的结果
*/